UB_Copy/src/Documents/УБ_ПереводНаДолжность/УБ_ПереводНаДолжность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УБ_ПереводНаДолжность</name>
  <registerRecords>InformationRegister.УБ_КадроваяИсторияСотрудников</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПеревода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьПодразделениеИМодельПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменитьГрейдСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

UB_Copy/src/InformationRegisters/УБ_МоделиПланированияСотрудников/УБ_МоделиПланированияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_МоделиПланированияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </resources>
  <resources>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </resources>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КадровыйДокумент</name>
    <type>
      <types>DocumentRef.КадровыйПереводСписком</types>
      <types>DocumentRef.ПриемНаРаботуСписком</types>
      <types>DocumentRef.КадровыйПеревод</types>
      <types>DocumentRef.УБ_НазначениеНаДолжность</types>
      <types>DocumentRef.УБ_ПереводНаДолжность</types>
      <types>DocumentRef.ПриемНаРаботу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/Documents/УБ_ПереводНаДолжность/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
	Если Не ЗначениеЗаполнено(ДатаПеревода) Тогда
		ДатаПеревода = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УБ_ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	Документы.УБ_ПереводНаДолжность.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	УБ_ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	УБ_КадровыйУчет.УБ_ОтменаПроведенияКадровыхДокументовОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	Если ИзменитьПодразделениеИМодельПланирования Тогда
		УБ_КадровыйУчет.ПереопределитьДатуОтстраненияРуководителя(ЭтотОбъект.Сотрудник, ЭтотОбъект.Организация, ЭтотОбъект.ДатаПеревода, Истина);
	КонецЕсли;
	РегистрыСведений.УБ_МоделиПланированияСотрудников.ЗаписатьМодельПланированияСотрудника(
		ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаМоделиПланированияСотрудников, Отказ);
	//РегистрыСведений.УБ_РуководителиПодразделений.ЗаписатьРуководителейПодразделений(
	//	ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРуководителиПодразделений);
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы") Тогда
		УБ_КадровыйУчет.СформироватьКадровыеДвижения(ЭтотОбъект, Движения,
			 ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКадроваяИсторияСотрудников, Истина);
	КонецЕсли;
	
	УБ_ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	УБ_ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ИзменитьПодразделениеИМодельПланирования Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Подразделение");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "МодельПланированияЭффективности");
	КонецЕсли;
	
	Если Не ИзменитьПодразделениеИМодельПланирования И Не ИзменитьГрейдСотрудника Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Грейд");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	УБ_ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	УБ_ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	УБ_ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	УБ_ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
